{
  "backend/main.mo": "Motoko actor implementing a contact message system with owner-based access control, message CRUD operations, and hardcoded contact information retrieval for AKANKSHA ENTERPRISES.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of contact section updates with specific phone numbers, email, and address details.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing component responsibilities, styling approach, and data flow patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode color tokens for an industrial-themed design palette.",
  "frontend/index.html": "HTML entry point setting page title to 'AKANKSHA ENTERPRISES' and mounting the React application.",
  "frontend/src/App.tsx": "Root React component wrapping HomePage with Toaster for notifications.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying owner name, company description, and four feature cards highlighting quality, expertise, pricing, and trust.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, state management, and backend integration using React Query mutation to submit messages with toast notifications.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying company contact details (two phone numbers, email, address with pincode) fetched from backend alongside an integrated contact form.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, company name, navigation menu, and mobile-responsive hamburger menu implementing smooth scroll navigation.",
  "frontend/src/components/HeroSection.tsx": "Hero section component displaying the main banner for Akanksha Enterprises with company name, tagline, call-to-action buttons, and smooth scroll navigation to contact and services sections.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component that displays a service with an icon, title, and description, featuring hover effects and transitions.",
  "frontend/src/components/ServicesSection.tsx": "Services section component that displays a grid of 8 scrap trading service categories (metal, paper, plastic, e-waste, automotive, industrial, construction, electrical) using ServiceCard components.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching contact info, submitting messages, and retrieving all messages from the backend actor.",
  "frontend/src/index.css": "Global CSS file defining Tailwind layers and custom CSS variables for light/dark theme colors using an earthy, industrial color palette with forest green as primary.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that composes Header, Footer, HeroSection, AboutSection, ServicesSection, and ContactSection into a full-page layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including container settings, font families, OKLCH color system, border radius variables, shadows, and animations with typography and container query plugins.",
  "project_state.json": "Project state file tracking a scrap trading website for AKANKSHA ENTERPRISES owned by Bhupendra Singh Chandel. Contains existing features (homepage, about, services, contact sections with professional B2B theme) and pending feature requests including logo integration."
}